Configuration_project_01/src/Documents/АЭС_ТоварныеПредложения/АЭС_ТоварныеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АЭС_ТоварныеПредложения</name>
  <registerRecords>InformationRegister.АЭС_ТорговыеПредложения</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеСКлиентом</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.АЭС_ВидТорговогоПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРеквизит1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноИзменять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивироватьТорговоеПредложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration_project_01/src/InformationRegisters/АЭС_АктуальныеПриоритеты/АЭС_АктуальныеПриоритеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_АктуальныеПриоритеты</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/InformationRegisters/АЭС_ПриоритетыСкладов/АЭС_ПриоритетыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_ПриоритетыСкладов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.АЭС_ПунктыВыдачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/InformationRegisters/АЭС_КонсигнантыПринципалыНоменклатуры/АЭС_КонсигнантыПринципалыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_КонсигнантыПринципалыНоменклатуры</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонсигнантыПринципалы</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/Enums/АЭС_ВидТорговогоПредложения/АЭС_ВидТорговогоПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АЭС_ВидТорговогоПредложения</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Атом</name>
  </enumValues>
  <enumValues>
    <name>Консигнация</name>
  </enumValues>
</mdclass:Enum>

Configuration_project_01/src/Documents/АЭС_ТоварныеПредложения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаТоварныхПредложений(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаТоварныхПредложений(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "АЭС_ТорговыеПредложения";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса ="
		|ВЫБРАТЬ
		|	Товары.Ссылка       				КАК Ссылка,
		|	Товары.Ссылка.Склад     			КАК Склад,
		|	Товары.Ссылка.Организация   		КАК Организация, 
		|	Товары.Ссылка.Подразделение   		КАК Подразделение,
		|	Товары.Ссылка.ТипОперации   		КАК ТипОперации,
		|	Товары.Ссылка.Контрагент   			КАК Контрагент,
		|	Товары.Ссылка.СоглашениеСКлиентом	КАК СоглашениеСКлиентом,
		|	Товары.Ссылка.ВидЦеныКонтрагента	КАК ВидЦеныКонтрагента,
		|	Товары.Ссылка.ВидЦены   			КАК ТипЦены,
		|	Товары.Ссылка.Дата					КАК ПЕРИОД,
		|	Товары.Номенклатура 				КАК Номенклатура
		|ИЗ
		|	Документ.АЭС_ТоварныеПредложения.Товары КАК Товары
		|
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка,
		|	Товары.Номенклатура
		|
		|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗарегистрироватьТорговыеПредложенияДляВыгрузки(ДокументСсылка) Экспорт
		
	Запрос	= Новый Запрос;
	ТекстЗапроса	= "	
		|ВЫБРАТЬ
		|	Б_ОбменССайтом.Ссылка КАК УзелОбмена,
		|	ТоварныеПредложения.Номенклатура КАК Номенклатура
		|ИЗ
		|	ПланОбмена.Б_ОбменССайтом КАК Б_ОбменССайтом,
		|	Документ.АЭС_ТоварныеПредложения.Товары КАК ТоварныеПредложения
		|ГДЕ
		|	НЕ Б_ОбменССайтом.ЭтотУзел
		|	И НЕ Б_ОбменССайтом.ПометкаУдаления
		|	И Б_ОбменССайтом.ОбменТоварами
		|	И Б_ОбменССайтом.ВыгружатьТолькоИзменения
		|	И ТоварныеПредложения.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	Запрос.Текст	= ТекстЗапроса;
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелОбмена,Выборка.Номенклатура);
		
	КонецЦикла; // Пока Выборка.Следующий() Цикл
		
КонецПроцедуры // Процедура ЗарегистрироватьТорговыеПредложенияДлявыгрузки()	

#КонецОбласти

#Область Прочее

Функция ЗаполнитьТовары(ТипЗаполнения,ТипОперации,Организация,Контрагент,Дата,БизнесРегион) Экспорт
	
	Запрос	= Новый Запрос;
	
	Если ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Атом Тогда
			
		Если ТипЗаполнения = "1" Тогда 
			
			ТекстЗапроса	= "
				|ВЫБРАТЬ
				|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
				|	СвободныеОстаткиОстатки.Номенклатура.Код КАК Код,
				|	СвободныеОстаткиОстатки.Номенклатура.Артикул КАК Артикул
				|ИЗ
				|	РегистрНакопления.СвободныеОстатки.Остатки(
				|			&ДатаСреза,
				|			Склад.БизнесРегион = &БизнесРегион 
				|			И НЕ Склад.СкладОтветственногоХранения) КАК СвободныеОстаткиОстатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	СвободныеОстаткиОстатки.Номенклатура.Наименование";
		ИначеЕсли ТипЗаполнения = "2" Тогда
			
			ТекстЗапроса	= "
				|ВЫБРАТЬ
				|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
				|	СвободныеОстаткиОстатки.Номенклатура.Код КАК Код,
				|	СвободныеОстаткиОстатки.Номенклатура.Артикул КАК Артикул
				|ИЗ
				|	РегистрНакопления.СвободныеОстатки.Остатки(
				|			&ДатаСреза,
				|			Склад.БизнесРегион = &БизнесРегион) КАК СвободныеОстаткиОстатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	СвободныеОстаткиОстатки.Номенклатура.Наименование";

			
		ИначеЕсли ТипЗаполнения = "3" Тогда
			
			ТекстЗапроса	= "
				|ВЫБРАТЬ
				|	Документ.Организация КАК Организация,
				|	Документ.Регистратор КАК Регистратор
				|ПОМЕСТИТЬ ДокРегистратор
				|ИЗ
				|	РегистрСведений.АЭС_АктуальныеПриоритеты.СрезПоследних(
				|			,
				|			Организация = &Организация) КАК Документ
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПриоритетыСкладов.Склад КАК Склад
				|ПОМЕСТИТЬ ВТ_Склады	
				|ИЗ
				|	РегистрСведений.АЭС_ПриоритетыСкладов.СрезПоследних(
				|			,
				|			Регистратор В
				|				(ВЫБРАТЬ
				|					Рег.Регистратор
				|				ИЗ
				|					ДокРегистратор КАК Рег)) КАК ПриоритетыСкладов
				|					
				|;
				|////////////////////////////////////////////////////////////////////////////////					
				|					
				|ВЫБРАТЬ
				|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
				|	СвободныеОстаткиОстатки.Номенклатура.Код КАК Код,
				|	СвободныеОстаткиОстатки.Номенклатура.Артикул КАК Артикул
				|ИЗ
				|	РегистрНакопления.СвободныеОстатки.Остатки(&ДатаСреза, Склад В (ВЫБРАТЬ Склады.Склад ИЗ ВТ_Склады КАК Склады )) КАК СвободныеОстаткиОстатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	СвободныеОстаткиОстатки.Номенклатура.Наименование";
			
			Запрос.УстановитьПараметр("Организация",	Организация);
			
		КонецЕсли; // Если ТипЗаполнения = "1" Тогда	
		
	ИначеЕсли ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Консигнация Тогда
		
		ТекстЗапроса	= "
			|ВЫБРАТЬ
			|	АЭС_КонсигнантыПринципалыНоменклатуры.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ТНоменклатуры
			|ИЗ
			|	РегистрСведений.АЭС_КонсигнантыПринципалыНоменклатуры КАК АЭС_КонсигнантыПринципалыНоменклатуры
			|ГДЕ
			|	АЭС_КонсигнантыПринципалыНоменклатуры.Организация = &Организация
			|	И АЭС_КонсигнантыПринципалыНоменклатуры.КонсигнантыПринципалы = &Контрагент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстаткиОстатки.Номенклатура.Код КАК Код,
			|	СвободныеОстаткиОстатки.Номенклатура.Артикул КАК Артикул
			|	ПОМЕСТИТЬ Остатки
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			&ДатаСреза,
			|			Склад.БизнесРегион = &БизнесРегион
			|				И Склад.СкладОтветственногоХранения) КАК СвободныеОстаткиОстатки
			|;
			|////////////////////////////////				
			|ВЫБРАТЬ
			|	Выборка.Номенклатура,
			|	Выборка.Код,
			|	Выборка.Артикул
			|ИЗ
			|	Остатки КАК Выборка
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТНоменклатуры КАК ТНоменклатуры
			|		ПО Выборка.Номенклатура = ТНоменклатуры.Номенклатура
			|УПОРЯДОЧИТЬ ПО
			|	Выборка.Номенклатура.Наименование";
		
	 	Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("Контрагент",		Контрагент);

	КонецЕсли; // Если Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Атом Тогда
	
	Запрос.Текст	= ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаСреза",		Дата);
	Запрос.УстановитьПараметр("БизнесРегион",	БизнесРегион);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции // Функция ЗаполнитьТовары()	

//Формирование префикса документа
//
// Параметры:
// Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//  Строка - строковое значение префикса документа
//
Функция УстановитьПрефикс(Организация) Экспорт
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	// устанавливаем привилегированный режим
	УстановитьПривилегированныйРежим(Истина);
	
	ПрефиксИнформационнойБазы = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксИнформационнойБазы, 2, "0", "Слева");

	ПрефиксОрганизации = ПолучитьФункциональнуюОпцию("ПрефиксыОрганизаций", Новый Структура("Организация", Организация));
	
	// если задана пустая ссылка на организацию
	Если ПрефиксОрганизации = Ложь Тогда
		
		ПрефиксОрганизации = "";
		
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксОрганизации, 2, "0", "Слева");
	
	ОсновнойПрефикс = ПрефиксОрганизации + ПрефиксИнформационнойБазы;
	
	Разделитель = ?(ПустаяСтрока(ОсновнойПрефикс), "", "-");
	
	Префикс = ОсновнойПрефикс + Разделитель + Префикс;
	
	// если префикс не задан, то устанавливаем значение по умолчанию
	Если ПустаяСтрока(Префикс) Тогда
		
		Префикс = "0";
		
	КонецЕсли;
	
	Возврат Префикс;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
